//==========================================================
//
//デバッグ表示処理 [debugproc.h]
//Author Ibuki Okusada
// Added by Tomoya Kanazaki
//
//==========================================================
#ifndef _DEBUGPROC_H_		//このマクロが定義されていない場合
#define _DEBUGPROC_H_

//**********************************************************
//マクロ定義
//**********************************************************
#define MAX_DEBUGSTRING	(2048)	//デバッグ表示の最大文字数

//**********************************************************
//ネームスペースの定義
//**********************************************************
namespace DebugProc
{
	void Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);
	void Print(const char *fmt, ...);
};

#endif